Solvers/myPimpleVJPDCFinal/testCase/0/Ufaces
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       surfaceVectorField;
    location    "0";
    object      Ufaces;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];


internalField   nonuniform List<vector> 
9296
(
(1.0010 -0.0037654 0)
(1.0020 -0.00688133 0)
(1.0030 -0.00400964 0)
(1.0040 -0.00830596 0)
(1.0050 -0.00415022 0)
(1.0060 -0.00860156 0)
(1.0070 -0.00427767 0)
(1.0080 -0.00886918 0)
...
)
;

boundaryField
{
    outlet
    {
        type            calculated;
        value           nonuniform List<vector> 
40
(
(1.07407 -0.00133861 0)
(1.06406 -0.00128158 0)
(1.06339 -0.000229365 0)
(1.06304 8.42439e-05 0)
(1.06285 0.000100223 0)
(1.06273 7.02739e-05 0)
(1.06266 4.58916e-05 0)
(1.06261 3.03116e-05 0)
...
)
;
    }
    inlet
    {
        type            calculated;
        value           uniform (1 0 0);
    }
    upperwall
    {
        type            calculated;
        value           uniform (0 0 0);
    }
    lowerwall
    {
        type            calculated;
        value           uniform (0 0 0);
    }
    column
    {
        type            calculated;
        value           uniform (0 0 0);
    }
    defaultFaces
    {
        type            empty;
        value           nonuniform List<vector> 0();
    }
}